app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "tteaa"], ["description", "asdas"], ["created_at", "2023-12-14 17:34:42.762742"], ["updated_at", "2023-12-14 17:34:42.762742"]]
---
  def create
    @article = Article.new(params.require(:article).permit(:title, :description))
    if @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "aaa"], ["updated_at", "2023-12-14 18:42:04.394846"], ["id", 1]]
---
  def update
    if @article.update(params.require(:article).permit(:title, :description))